import random
import pandas as pd
stu = {
  'mentee':random.sample(['강서현', '고민석', '김도훈', '김승환', '김예림', '김지아', '김형우', '박건우', '박성빈', '박태현', '변용훈', '양다현', '오치영', '이수빈', '장지호', '정하정', '최승운', '최향아', '현도훈', '현승원', '현정운', '강지윤', '고창환', '김나연', '김도율', '김빛나', '김아영', '김채현', '김태이', '김현상', '김효빈', '송민준', '양승우', '유서준', '이건우', '이권', '이세호', '이예찬', '이은상', '이준이', '정우진'], 41),
  'mentor':random.sample(['배한철', '강민석', '강서준', '강우영', '강우영', '고용윤', '국승호', '김건규', '김남영', '김두아', '김민규', '김민엽', '김보현', '김성환', '김세은', '김지윤', '김희수', '남성관', '김동현', '김태성', '한우진', '문예빈', '변준영', '성현재', '채수연', '양성웅', '양성현', '양재민', '양준혁', '오지훈', '오진혁', '이유빈', '이지후', '이호걸', '임유빈', '정상현', '최지우', '왕준섭', '한재석', '현승민', '현지혜'], 41)
}
frame = pd.DataFrame(stu)
print(frame)
frame.to_csv(r"C:\Users\Kim\Desktop\firebase - Copy\firebase_test\mtmt.csv",index=False)